Repository: meshwallet/Mesh-Wallet
Catalog: mobile/ios/Mesh/Localizable.xcstrings
Source language: en
Languages: ar, es, id, ru, tr, vi, zh_hans

# send.available.on.slot
source: Available on this address: %@
ar: متاح على هذا العنوان: %@
zh_hans: 此地址可用：%@

# send.deep.recovery.button
source: Move deep USDT to main address
ar: نقل USDT العميق إلى العنوان الرئيسي
zh_hans: 将深层 USDT 移至主地址

# send.deep.recovery.done
source: Moved from %@ addresses. Balance updated.
ar: تم النقل من %@ عناوين. تم تحديث الرصيد.
zh_hans: 已从 %@ 个地址移动。余额已更新。

# send.deep.recovery.hint
source: Scans up to 1,024 old receive paths and sends any USDT found to your main address. The rest of the app only uses your five receive addresses.
ar: يفحص حتى 1,024 مسار استلام قديم ويرسل أي USDT موجود إلى عنوانك الرئيسي. بقية التطبيق تستخدم عناوين الاستلام الخمسة فقط.
zh_hans: 扫描最多 1,024 个旧收款路径，将找到的 USDT 发送至主地址。应用其余部分仅使用五个收款地址。

# send.deep.recovery.homeBanner
source: Deep recovery %1$@ / %2$@ — you can leave this screen
ar: استرداد عميق %1$@ / %2$@ — يمكنك مغادرة هذه الشاشة
zh_hans: 深层恢复 %1$@ / %2$@ — 你可以离开此页面

# send.deep.recovery.rateLimited
source: Tron API rate limit reached. Wait about a minute and try again — the scan will resume more slowly.
ar: تم الوصول إلى حد Tron API. انتظر حوالي دقيقة وحاول مرة أخرى — سيستأنف الفحص ببطء أكبر.
zh_hans: 已达到 Tron API 速率限制。请等待约一分钟后重试——扫描将以较慢速度继续。

# send.deep.recovery.scanning
source: Scanning deep addresses…
ar: جارٍ فحص العناوين العميقة…
zh_hans: 正在扫描深层地址…

# send.deep.recovery.scanProgress
source: Checked %1$@ of %2$@ addresses
ar: تم فحص %1$@ من %2$@ عنوان
zh_hans: 已检查 %1$@ / %2$@ 个地址

# send.deep.recovery.title
source: Deep address recovery
ar: استرداد العناوين العميقة
zh_hans: 深层地址恢复

# send.deep.recovery.transferProgress
source: Transfer %1$@ of %2$@
ar: تحويل %1$@ من %2$@
zh_hans: 转账 %1$@ / %2$@

# send.deep.recovery.transferring
source: Moving USDT to main address…
ar: جارٍ نقل USDT إلى العنوان الرئيسي…
zh_hans: 正在将 USDT 移至主地址…

# send.failed
source: Couldn't send
ar: تعذّر الإرسال
es: No se pudo enviar
id: Gagal kirim
tr: Gönderilemedi
vi: Không gửi được
zh_hans: 发送失败

# send.fee.format
source: Fee %@
ar: الرسوم %@
es: Comisión %@
id: Biaya %@
tr: Ücret %@
vi: Phí %@
zh_hans: 手续费 %@

# send.fee.label
source: Send fee
ar: رسوم الإرسال
es: Comisión de envío
id: Biaya kirim
tr: Gönderim ücreti
vi: Phí gửi
zh_hans: 发送手续费

source: Send from address
ar: الإرسال من العنوان
zh_hans: 从此地址发送

# send.keep.open
source: Keep Mesh open until this finishes.
ar: أبقِ Mesh مفتوحًا حتى ينتهي.
es: Mantén Mesh abierta hasta que termine.
id: Biarkan Mesh terbuka sampai selesai.
tr: Bitene kadar Mesh'i açık tutun.
vi: Giữ Mesh mở cho đến khi hoàn tất.
zh_hans: 请保持 Mesh 打开直至完成。

# send.method.direct
source: Direct
ar: مباشر
es: Directo
id: Langsung
tr: Doğrudan
vi: Trực tiếp
zh_hans: 直接

# send.method.direct.detail
source: Sends from your main wallet. Fastest option.
ar: يرسل من محفظتك الرئيسية. الخيار الأسرع.
es: Envía desde tu billetera principal. La opción más rápida.
id: Kirim dari dompet utama. Opsi tercepat.
tr: Ana cüzdanınızdan gönderir. En hızlı seçenek.
vi: Gửi từ ví chính. Tùy chọn nhanh nhất.
zh_hans: 从主钱包发送。最快选项。

# send.method.private
source: Secure
ar: آمن
es: Seguro
id: Aman
tr: Güvenli
vi: Bảo mật
zh_hans: 安全

# send.method.private.detail
source: One intermediate wallet — recipient does not see your main address.
ar: محفظة وسيطة واحدة — المستلم لا يرى عنوانك الرئيسي.
es: Una billetera intermedia — el destinatario no ve tu dirección principal.
id: Satu dompet perantara — penerima tidak melihat alamat utama.
tr: Bir ara cüzdan — alıcı ana adresinizi görmez.
vi: Một ví trung gian — người nhận không thấy địa chỉ chính.
zh_hans: 一个中间钱包——收款方看不到你的主地址。

# send.method.private.hops
source: 1 intermediate wallet — recipient does not see your main address
ar: محفظة وسيطة واحدة — المستلم لا يرى عنوانك الرئيسي
es: 1 billetera intermedia — el destinatario no ve tu dirección principal
id: 1 dompet perantara — penerima tidak melihat alamat utama
tr: 1 ara cüzdan — alıcı ana adresinizi görmez
vi: 1 ví trung gian — người nhận không thấy địa chỉ chính
zh_hans: 一个中间钱包——收款方看不到你的主地址

# send.network.resources
source: Network resources covered
ar: موارد الشبكة مغطاة
es: Recursos de red incluidos
id: Sumber daya jaringan ditanggung
tr: Ağ kaynakları karşılanır
vi: Tài nguyên mạng được hỗ trợ
zh_hans: 网络资源已覆盖

# send.no.trx.needed
source: No TRX needed
ar: لا حاجة لـ TRX
es: No necesitas TRX
id: Tidak perlu TRX
tr: TRX gerekmez
vi: Không cần TRX
zh_hans: 无需 TRX

# send.outcome.activity.hint
source: It may take a minute to appear in activity.
ar: قد يستغرق ظهوره في النشاط دقيقة.
es: Puede tardar un minuto en aparecer en actividad.
id: Mungkin perlu satu menit untuk muncul di aktivitas.
tr: Hareketlerde görünmesi bir dakika sürebilir.
vi: Có thể mất một phút để hiện trong hoạt động.
zh_hans: 可能需要一分钟才会出现在活动中。

# send.outcome.failed.fee.hint
source: No USDT left your wallet. The send fee is only charged after network preparation succeeds.
ar: لم يغادر USDT محفظتك. تُفرض رسوم الإرسال فقط بعد نجاح تجهيز الشبكة.
es: No salió USDT de tu billetera. La comisión solo se cobra tras preparar la red.
id: Tidak ada USDT yang keluar. Biaya kirim hanya dibebankan setelah persiapan jaringan berhasil.
tr: USDT cüzdanınızdan çıkmadı. Gönderim ücreti yalnızca ağ hazırlığı başarılı olduktan sonra alınır.
vi: Không có USDT rời ví. Phí gửi chỉ thu sau khi chuẩn bị mạng thành công.
zh_hans: USDT 未离开你的钱包。发送手续费仅在网络准备成功后收取。

# send.preparing
source: Preparing your send…
ar: جارٍ تجهيز إرسالك…
es: Preparando tu envío…
id: Menyiapkan pengiriman…
tr: Gönderiniz hazırlanıyor…
vi: Đang chuẩn bị gửi…
zh_hans: 正在准备发送…

# send.preparing.network
source: Preparing network…
ar: جارٍ تجهيز الشبكة…
zh_hans: 正在准备网络…

# send.private.route.hint
source: Secure route step %1$d/%2$d…
ar: خطوة المسار الآمن %1$d/%2$d…
es: Paso de ruta privada %1$d/%2$d…
id: Langkah rute privat %1$d/%2$d…
tr: Gizli rota adım %1$d/%2$d…
vi: Bước tuyến riêng %1$d/%2$d…
zh_hans: 安全路由步骤 %1$d/%2$d…

# send.processing
source: Processing
ar: جارٍ المعالجة
es: Procesando
id: Memproses
tr: İşleniyor
vi: Đang xử lý
zh_hans: 处理中

# send.processing.activating
source: Activating your address
ar: جارٍ تفعيل عنوانك
zh_hans: 正在激活你的地址

# send.processing.activating.hint
source: First-time setup on Tron. Do not close Mesh until activation finishes.
ar: إعداد أول مرة على Tron. لا تغلق Mesh حتى ينتهي التفعيل.
zh_hans: Tron 上的首次设置。激活完成前请勿关闭 Mesh。

# send.processing.activating.keepOpen
source: Keep Mesh open while your address activates and your send starts.
ar: أبقِ Mesh مفتوحًا أثناء تفعيل عنوانك وبدء إرسالك.
zh_hans: 地址激活和发送启动期间请保持 Mesh 打开。

# send.processing.activating.subtitle
source: Mesh is activating your wallet on Tron before USDT can be sent. Please wait — this usually takes under a minute.
ar: Mesh يفعّل محفظتك على Tron قبل إرسال USDT. يرجى الانتظار — يستغرق هذا عادةً أقل من دقيقة.
zh_hans: Mesh 正在 Tron 上激活你的钱包，之后才能发送 USDT。请稍候——通常不到一分钟。

# send.processing.background.safe
source: Mesh is sending on the network. You can close the app.
ar: Mesh يرسل على الشبكة. يمكنك إغلاق التطبيق.
zh_hans: Mesh 正在网络上发送。你可以关闭应用。

# send.processing.hint.direct
source: Usually finishes in under a minute. You can close the app and check Activity.
ar: ينتهي عادةً في أقل من دقيقة. يمكنك إغلاق التطبيق والتحقق من النشاط.
es: Suele terminar en menos de un minuto. Puedes cerrar la app y revisar Actividad.
id: Biasanya selesai dalam satu menit. Anda bisa menutup app dan cek Aktivitas.
tr: Genelde bir dakikadan kısa sürer. Uygulamayı kapatabilir ve Hareketler'e bakabilirsiniz.
vi: Thường hoàn tất trong một phút. Bạn có thể đóng app và xem Hoạt động.
zh_hans: 通常不到一分钟完成。你可以关闭应用并在活动中查看。

# send.processing.hint.private
source: Usually 2–3 minutes. You can close the app and check Activity.
ar: عادةً 2–3 دقائق. يمكنك إغلاق التطبيق والتحقق من النشاط.
es: Completando tu ruta privada… mantén la app abierta.
id: Menyelesaikan rute privat… biarkan app terbuka.
tr: Gizli rotanız tamamlanıyor… uygulamayı açık tutun.
vi: Đang hoàn tất tuyến riêng tư… giữ app mở.
zh_hans: 通常 2–3 分钟。你可以关闭应用并在活动中查看。

# send.processing.preparing
source: Preparing your send
ar: جارٍ تجهيز إرسالك
zh_hans: 正在准备发送

# send.processing.preparing.hint
source: Signing and registering with Mesh. Keep the app open briefly.
ar: التوقيع والتسجيل مع Mesh. أبقِ التطبيق مفتوحًا لفترة قصيرة.
zh_hans: 正在与 Mesh 签名并注册。请短暂保持应用打开。

# send.processing.subtitle
source: Your transfer was submitted.
ar: تم إرسال تحويلك.
es: Tu transferencia fue enviada.
id: Transfer Anda telah dikirim.
tr: Transferiniz gönderildi.
vi: Giao dịch của bạn đã được gửi.
zh_hans: 你的转账已提交。

# send.review.arrives
source: Arrives
ar: يصل
es: Llega
id: Tiba
tr: Varış
vi: Đến trong
zh_hans: 到账

# send.review.network
source: Network
ar: الشبكة
es: Red
id: Jaringan
tr: Ağ
vi: Mạng
zh_hans: 网络

# send.review.prep.activatingOnTron
source: Activating address on Tron…
ar: جارٍ تفعيل العنوان على Tron…
zh_hans: 正在 Tron 上激活地址…

# send.review.prep.checkingAddress
source: Checking address status…
ar: جارٍ التحقق من حالة العنوان…
zh_hans: 正在检查地址状态…

# send.review.prep.checkingNetwork
source: Checking network readiness…
ar: جارٍ التحقق من جاهزية الشبكة…
zh_hans: 正在检查网络就绪状态…

# send.review.prep.hint.activation
source: Mesh activates your send address on Tron so USDT can leave your wallet. This usually takes a few seconds.
ar: Mesh يفعّل عنوان إرسالك على Tron حتى يمكن إرسال USDT من محفظتك. يستغرق هذا عادةً بضع ثوانٍ.
ru: Mesh активирует ваш адрес в Tron, чтобы USDT могли отправиться. Обычно это занимает несколько секунд.
zh_hans: Mesh 在 Tron 上激活你的发送地址，以便 USDT 可以离开钱包。通常只需几秒钟。

# send.review.prep.hint.fee
source: Signing the send fee so Mesh can finish your transfer in the background.
ar: توقيع رسوم الإرسال حتى يتمكن Mesh من إنهاء تحويلك في الخلفية.
ru: Подписываем комиссию, чтобы Mesh мог завершить перевод в фоне.
zh_hans: 正在签名发送手续费，以便 Mesh 在后台完成转账。

# send.review.prep.hint.generic
source: Getting everything ready on Tron before you can swipe to send.
ar: جارٍ تجهيز كل شيء على Tron قبل أن تتمكن من السحب للإرسال.
ru: Готовим всё в Tron — скоро можно будет провести слайдер.
zh_hans: 在滑动发送前，正在 Tron 上准备一切。

# send.review.prep.hint.network
source: Mesh pays the Tron network fee for you — no TRX needed. This usually takes a few seconds.
ar: Mesh يدفع رسوم شبكة Tron نيابة عنك — لا حاجة لـ TRX. يستغرق هذا عادةً بضع ثوانٍ.
ru: Mesh оплачивает комиссию Tron за вас — TRX не нужны. Обычно это занимает несколько секунд.
zh_hans: Mesh 为你支付 Tron 网络手续费——无需 TRX。通常只需几秒钟。

# send.review.prep.preparingBandwidth
source: Preparing network bandwidth…
ar: جارٍ تجهيز عرض النطاق…
zh_hans: 正在准备网络带宽…

# send.review.prep.preparingFee
source: Preparing send fee…
ar: جارٍ تجهيز رسوم الإرسال…
ru: Подготовка комиссии…
zh_hans: 正在准备发送手续费…

# send.review.prep.requestingEnergy
source: Requesting network energy…
ar: جارٍ طلب طاقة الشبكة…
zh_hans: 正在请求网络能量…

# send.review.prep.retryingActivation
source: Retrying address activation…
ar: جارٍ إعادة محاولة تفعيل العنوان…
zh_hans: 正在重试地址激活…

# send.review.prep.retryingNetwork
source: Retrying network preparation…
ar: جارٍ إعادة محاولة تجهيز الشبكة…
zh_hans: 正在重试网络准备…

# send.review.prep.waitingActivation
source: Waiting for activation confirmation…
ar: جارٍ انتظار تأكيد التفعيل…
zh_hans: 正在等待激活确认…

# send.review.prep.waitingBandwidth
source: Waiting for network bandwidth…
ar: جارٍ انتظار عرض النطاق…
zh_hans: 正在等待网络带宽…

# send.review.prep.waitingEnergy
source: Waiting for network energy…
ar: جارٍ انتظار طاقة الشبكة…
zh_hans: 正在等待网络能量…

# send.review.prep.waitingResources
source: Waiting for network resources…
ar: جارٍ انتظار موارد الشبكة…
zh_hans: 正在等待网络资源…

# send.review.private.deposit
source: Sending via secure deposit address when possible.
ar: الإرسال عبر عنوان إيداع آمن عند الإمكان.
es: Envío por dirección de depósito privada cuando sea posible.
id: Kirim via alamat deposit privat jika memungkinkan.
tr: Mümkünse gizli yatırma adresi üzerinden gönderilir.
vi: Gửi qua địa chỉ nạp riêng tư khi có thể.
zh_hans: 尽可能通过安全存款地址发送。

# send.review.sending
source: You're sending
ar: أنت ترسل
es: Estás enviando
id: Anda mengirim
tr: Gönderiyorsunuz
vi: Bạn đang gửi
zh_hans: 你正在发送

# send.review.title
source: Review and send
ar: مراجعة وإرسال
es: Revisar y enviar
id: Tinjau dan kirim
tr: İncele ve gönder
vi: Xem lại và gửi
zh_hans: 审核并发送

# send.review.to
source: To
ar: إلى
es: Para
id: Ke
tr: Kime
vi: Đến
zh_hans: 至

# send.review.total
source: Total
ar: الإجمالي
tr: Toplam
vi: Tổng
zh_hans: 总计

# send.scan.qr
source: Scan QR
ar: مسح QR
es: Escanear QR
id: Pindai QR
tr: QR tara
vi: Quét QR
zh_hans: 扫描二维码

# send.send.to.self
source: My accounts
ar: حساباتي
ru: Мои счета
zh_hans: 我的账户

# send.sent
source: Sent
ar: تم الإرسال
es: Enviado
id: Terkirim
tr: Gönderildi
vi: Đã gửi
zh_hans: 已发送

# send.slide.confirm
source: Slide to send
ar: اسحب للإرسال
es: Desliza para enviar
id: Geser untuk kirim
tr: Göndermek için kaydır
vi: Trượt để gửi
zh_hans: 滑动发送

# send.step.address
source: 1 of 3
ar: 1 من 3
es: 1 de 3
id: 1 dari 3

# send.step.amount
source: Amount
ar: المبلغ
es: Importe
id: Jumlah
tr: Tutar
vi: Số tiền
zh_hans: 金额

# send.step.amount.step
source: 2 of 3
ar: 2 من 3
es: 2 de 3
id: 2 dari 3

# send.step.progress
source: 3 of 3
ar: 3 من 3
es: 3 de 3
id: 3 dari 3

# send.step.protection
source: Protection
ar: الحماية
es: Protección
id: Perlindungan
tr: Koruma
vi: Bảo vệ
zh_hans: 保护

# send.step.recipient
source: To whom?
ar: إلى من؟
es: ¿A quién?
id: Kepada siapa?
tr: Kime?
vi: Gửi cho ai?
zh_hans: 发给谁？

# send.step.review
source: Review
ar: مراجعة
es: Revisar
id: Tinjau
tr: Kontrol
vi: Xem lại
zh_hans: 审核

# send.step.type
source: Send type
ar: نوع الإرسال
es: Tipo de envío
id: Jenis kirim
tr: Gönderim türü
vi: Loại gửi
zh_hans: 发送类型

# send.timing.direct
source: ~30 seconds
ar: ~30 ثانية
es: ~30 segundos
id: ~30 detik
tr: ~30 saniye
vi: ~30 giây
zh_hans: ~30 秒

# send.timing.private
source: ~2–3 min
ar: ~2–3 د
id: ~2–3 mnt
tr: ~2–3 dk
vi: ~2–3 phút
zh_hans: ~2–3 分钟

# send.title
source: Send USDT
ar: إرسال USDT
es: Enviar USDT
id: Kirim USDT
tr: USDT gönder
vi: Gửi USDT
zh_hans: 发送 USDT

# send.transaction.details
source: Transaction details
ar: تفاصيل المعاملة
es: Detalles de la transacción
id: Detail transaksi
tr: İşlem detayları
vi: Chi tiết giao dịch
zh_hans: 交易详情

# send.use.max
source: Use max
ar: استخدام الحد الأقصى
es: Usar máximo
id: Pakai maks
tr: Maksimumu kullan
vi: Dùng tối đa
zh_hans: 使用最大金额

# send.warning.review
source: Check the address and amount. Crypto transfers cannot be reversed.
ar: تحقق من العنوان والمبلغ. لا يمكن عكس تحويلات العملات المشفرة.
es: Revisa la dirección y el importe. Las transferencias cripto no se pueden revertir.
id: Periksa alamat dan jumlah. Transfer kripto tidak dapat dibatalkan.
tr: Adresi ve tutarı kontrol edin. Kripto transferleri geri alınamaz.
vi: Kiểm tra địa chỉ và số tiền. Giao dịch crypto không thể hoàn tác.
zh_hans: 请核对地址和金额。加密货币转账无法撤销。

# settings.biometric.confirm
source: Confirm with %@…
ar: تأكيد بـ %@…
es: Confirma con %@…
id: Konfirmasi dengan %@…
tr: %@ ile onaylayın…
vi: Xác nhận bằng %@…
zh_hans: 使用 %@ 确认…

# settings.biometric.enable.reason
source: Enable %@ to unlock Mesh
ar: تفعيل %@ لفتح Mesh
es: Activa %@ para desbloquear Mesh
id: Aktifkan %@ untuk membuka kunci Mesh
tr: Mesh kilidini açmak için %@ etkinleştirin
vi: Bật %@ để mở khóa Mesh
zh_hans: 启用 %@ 以解锁 Mesh

# settings.biometric.not.available
source: Biometrics are not available on this device.
ar: المصادقة البيومترية غير متاحة على هذا الجهاز.
es: La biometría no está disponible en este dispositivo.
id: Biometrik tidak tersedia di perangkat ini.
tr: Biyometri bu cihazda kullanılamıyor.
vi: Sinh trắc học không khả dụng trên thiết bị này.
zh_hans: 此设备不支持生物识别。

# settings.biometric.not.setup
source: %@ is not set up on this device.
ar: %@ غير مُعد على هذا الجهاز.
es: %@ no está configurado en este dispositivo.
id: %@ belum diatur di perangkat ini.
tr: %@ bu cihazda ayarlanmamış.
vi: %@ chưa được thiết lập trên thiết bị này.
zh_hans: 此设备未设置 %@。

# settings.biometric.setup.first
source: Set up a passcode first
ar: أعدّ رمز مرور أولًا
es: Configura primero un código
id: Atur kode sandi terlebih dahulu
tr: Önce parola oluşturun
vi: Trước tiên hãy đặt mã PIN
zh_hans: 请先设置密码

# settings.biometric.setup.settings
source: Set up %@ in iPhone Settings
ar: أعدّ %@ في إعدادات iPhone
es: Configura %@ en Ajustes del iPhone
id: Atur %@ di Pengaturan iPhone
tr: iPhone Ayarları'nda %@ ayarlayın
vi: Thiết lập %@ trong Cài đặt iPhone
zh_hans: 在 iPhone 设置中配置 %@

# settings.biometric.unavailable.device
source: Not available on this device
ar: غير متاح على هذا الجهاز
es: No disponible en este dispositivo
id: Tidak tersedia di perangkat ini
tr: Bu cihazda kullanılamıyor
vi: Không khả dụng trên thiết bị này
zh_hans: 此设备不可用

# settings.biometric.unlock.hint
source: Unlock with %@ when opening the app
ar: افتح القفل بـ %@ عند فتح التطبيق
es: Desbloquea con %@ al abrir la app
id: Buka kunci dengan %@ saat membuka aplikasi
tr: Uygulamayı açarken %@ ile kilidi aç
vi: Mở khóa bằng %@ khi mở ứng dụng
zh_hans: 打开应用时使用 %@ 解锁

# settings.contact.support
source: Contact support
ar: تواصل مع الدعم
es: Contactar soporte
id: Hubungi dukungan
tr: Destek ile iletişim
vi: Liên hệ hỗ trợ
zh_hans: 联系支持

# settings.passcode
source: Passcode
ar: رمز المرور
es: Código
id: Kode sandi
tr: Parola
vi: Mã PIN
zh_hans: 密码

# settings.passcode.change
source: Change your unlock passcode
ar: غيّر رمز مرور الفتح
es: Cambia tu código de acceso
id: Ubah kode sandi
tr: Kilitleme parolasını değiştir
vi: Đổi mã PIN mở khóa
zh_hans: 更改解锁密码

# settings.passcode.setup.hint
source: Set up when creating a wallet
ar: يُعدّ عند إنشاء محفظة
es: Configúralo al crear la billetera
id: Atur saat membuat dompet
tr: Cüzdan oluştururken ayarlanır
vi: Thiết lập khi tạo ví
zh_hans: 创建钱包时设置

# settings.passcode.updated.message
source: Your passcode has been changed.
ar: تم تغيير رمز المرور.
es: Tu código ha sido cambiado.
id: Kode sandi Anda telah diubah.
tr: Parolanız değiştirildi.
vi: Mã PIN của bạn đã được đổi.
zh_hans: 你的密码已更改。

# settings.passcode.updated.title
source: Passcode updated
ar: تم تحديث رمز المرور
es: Código actualizado
id: Kode sandi diperbarui
tr: Parola güncellendi
vi: Đã cập nhật mã PIN
zh_hans: 密码已更新

# settings.recovery.no.wallet
source: No active wallet.
ar: لا توجد محفظة نشطة.
es: No hay billetera activa.
id: Tidak ada dompet aktif.
tr: Aktif cüzdan yok.
vi: Không có ví đang hoạt động.
zh_hans: 没有活跃钱包。

# settings.recovery.not.stored
source: Recovery phrase is not stored for this wallet on this device.
ar: عبارة الاسترداد غير مخزّنة لهذه المحفظة على هذا الجهاز.
es: La frase de recuperación no está guardada para esta billetera en este dispositivo.
id: Frasa pemulihan tidak disimpan untuk dompet ini di perangkat.
tr: Bu cihazda bu cüzdan için kurtarma ifadesi kayıtlı değil.
vi: Cụm từ khôi phục không được lưu cho ví này trên thiết bị.
zh_hans: 此设备未存储该钱包的恢复短语。

# settings.recovery.phrase
source: Backup
ar: نسخة احتياطية
es: Respaldo
id: Cadangan
tr: Yedek
vi: Sao lưu
zh_hans: 备份

# settings.recovery.requires.passcode
source: Requires passcode
ar: يتطلب رمز مرور
es: Requiere código
id: Memerlukan kode sandi
tr: Parola gerekir
vi: Cần mã PIN
zh_hans: 需要密码

# settings.recovery.unavailable
source: Backup unavailable
ar: النسخة الاحتياطية غير متاحة
es: Frase de recuperación no disponible
id: Frasa pemulihan tidak tersedia
tr: Kurtarma ifadesi kullanılamıyor
vi: Không có cụm từ khôi phục
zh_hans: 备份不可用

# settings.remove.action
source: Remove wallet
ar: إزالة المحفظة
es: Eliminar billetera
id: Hapus dompet
tr: Cüzdanı kaldır
vi: Xóa ví
zh_hans: 移除钱包

# settings.remove.confirm.key
source: You will need your private key to access this wallet again.
ar: ستحتاج مفتاحك الخاص للوصول إلى هذه المحفظة مرة أخرى.
es: Necesitarás tu clave privada para acceder de nuevo a esta billetera.
id: Anda memerlukan kunci privat untuk mengakses dompet ini lagi.
tr: Bu cüzdana tekrar erişmek için özel anahtarınıza ihtiyacınız olacak.
vi: Bạn sẽ cần khóa riêng để truy cập lại ví này.
zh_hans: 你需要私钥才能再次访问此钱包。

# settings.remove.confirm.phrase
source: You will need your recovery phrase to access this wallet again.
ar: ستحتاج عبارة الاسترداد للوصول إلى هذه المحفظة مرة أخرى.
es: Necesitarás tu frase de recuperación para acceder de nuevo a esta billetera.
id: Anda memerlukan frasa pemulihan untuk mengakses dompet ini lagi.
tr: Bu cüzdana tekrar erişmek için kurtarma ifadenize ihtiyacınız olacak.
vi: Bạn sẽ cần cụm từ khôi phục để truy cập lại ví này.
zh_hans: 你需要恢复短语才能再次访问此钱包。

# settings.remove.confirm.title
source: Remove wallet from this device?
ar: إزالة المحفظة من هذا الجهاز؟
es: ¿Eliminar la billetera de este dispositivo?
id: Hapus dompet dari perangkat ini?
tr: Cüzdan bu cihazdan kaldırılsın mı?
vi: Xóa ví khỏi thiết bị này?
zh_hans: 从此设备移除钱包？

# settings.remove.wallet
source: Remove wallet from device
ar: إزالة المحفظة من الجهاز
es: Eliminar billetera del dispositivo
id: Hapus dompet dari perangkat
tr: Cüzdanı cihazdan kaldır
vi: Xóa ví khỏi thiết bị
zh_hans: 从设备移除钱包

# settings.title
source: Settings
ar: الإعدادات
es: Ajustes
id: Pengaturan
tr: Ayarlar
vi: Cài đặt
zh_hans: 设置

# settings.view.recovery.biometric.reason
source: View your backup in Mesh
ar: عرض نسختك الاحتياطية في Mesh
zh_hans: 在 Mesh 中查看备份

# settings.view.recovery.phrase
source: View backup
ar: عرض النسخة الاحتياطية
es: Ver respaldo
id: Lihat cadangan
tr: Yedeği görüntüle
vi: Xem sao lưu
zh_hans: 查看备份

# settings.view.recovery.subtitle
source: Enter your passcode to view your backup.
ar: أدخل رمز المرور لعرض نسختك الاحتياطية.
es: Introduce tu código para ver tu frase secreta.
id: Masukkan kode sandi untuk melihat frasa rahasia.
tr: Gizli ifadenizi görmek için parolanızı girin.
vi: Nhập mã PIN để xem cụm từ bí mật.
zh_hans: 输入密码以查看备份。

# settings.view.recovery.subtitle.biometric
source: Use %@ or enter your passcode.
ar: استخدم %@ أو أدخل رمز المرور.
zh_hans: 使用 %@ 或输入密码。

# ticker.network.fees
source: Network fees paid in USDT · TRX energy covered by Mesh
ar: رسوم الشبكة تُدفع بـ USDT · طاقة TRX مغطاة من Mesh
es: Comisiones en USDT · energía TRX cubierta por Mesh
id: Biaya jaringan dibayar USDT · energi TRX ditanggung Mesh
tr: Ağ ücretleri USDT ile · TRX enerjisi Mesh tarafından karşılanır
vi: Phí mạng trả bằng USDT · năng lượng TRX do Mesh hỗ trợ
zh_hans: 网络手续费以 USDT 支付 · TRX 能量由 Mesh 覆盖

# transaction.processing
source: Processing
ar: جارٍ المعالجة
es: Procesando
id: Memproses
tr: İşleniyor
vi: Đang xử lý
zh_hans: 处理中

# transaction.received
source: Received
ar: مستلم
es: Recibido
id: Diterima
tr: Alındı
vi: Đã nhận
zh_hans: 已收到

# transaction.sent
source: Sent
ar: مُرسَل
es: Enviado
id: Terkirim
tr: Gönderildi
vi: Đã gửi
zh_hans: 已发送

# transfer.proof.amount.received
source: %@ received
ar: تم استلام %@
zh_hans: 收到 %@

# transfer.proof.amount.sent
source: %@ sent
ar: تم إرسال %@
zh_hans: 发送 %@

# transfer.proof.clean.screenshot
source: Clean screenshot
ar: لقطة شاشة نظيفة
zh_hans: 干净截图

# transfer.proof.confirmed
source: Confirmed
ar: مؤكّد
zh_hans: 已确认

# transfer.proof.confirmed.on.network
source: Confirmed on TRON
ar: مؤكّد على TRON
zh_hans: 已在 TRON 上确认

# transfer.proof.copy.details
source: Copy details
ar: نسخ التفاصيل
zh_hans: 复制详情

# transfer.proof.copy.tx
source: Copy tx
ar: نسخ المعاملة
zh_hans: 复制交易

# transfer.proof.date
source: Date
ar: التاريخ
zh_hans: 日期

# transfer.proof.details.field
source: Details
ar: التفاصيل
zh_hans: 详情

# transfer.proof.details.title
source: Transfer details
ar: تفاصيل التحويل
zh_hans: 转账详情

# transfer.proof.from
source: From
ar: من
zh_hans: 来自

# transfer.proof.network.label
source: Network
ar: الشبكة
zh_hans: 网络

# transfer.proof.processing.on.network
source: Processing on TRON
ar: جارٍ المعالجة على TRON
zh_hans: 正在 TRON 上处理

# transfer.proof.ready.screenshot
source: Ready to screenshot
ar: جاهز للقطة شاشة
zh_hans: 可截图
